БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПлановыеСтатьиЗатратИДоходов</Name>
			<Comment>Бюджетирование грузоперевозок</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_Грузоперевозки</xr:Item>
				<xr:Item>Catalog.CW_ВариантыБюджетовПоЗаявкам</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатьиПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыСтатейПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаКурсаДляПроверки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма без НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Comment>Сумма, включая НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоРуб</Name>
					<Comment>Сумма, включая НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСРуб</Name>
					<Comment>Сумма НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРуб</Name>
					<Comment>Сумма без НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРуб</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКурсаВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПрогноза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДнейПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДСВСебестоимости</Name>
					<Comment>Учитывать НДСВСебестоимости</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_УтверждениеБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_УтверждениеБюджетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрогнозОплатыПлановыхСтатейБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрогнозОплатыПлановыхСтатейБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрогнозДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов/Forms/ФормаРедактированияГруппыСтатей/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользованиеСхемыПеревыставленияПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	
	ЭтаФорма.ТолькоПросмотр = _сф.ст_ПолучитьСвойство(Параметры,"ТолькоПросмотр");
	Если ЭтаФорма.ТолькоПросмотр Тогда
		
		Элементы.Бюджет.ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
		
		Элементы.БюджетПорядокОтраженияРасходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
		Элементы.БюджетПорядокОтраженияДоходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
		
	КонецЕсли;

	
	// реквизиты "шапки"
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ЗначенияЗаполнения);  
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		ЕдиницаИзмерения 	= Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда 
		Сообщить("Не выбрана версия бюджета!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	Если Валюта.Пустая() Тогда
		Если Параметры.ЗначенияЗаполнения.ВидСтатьиПланирования = перечисления.CW_ВидыСтатейПланирования.Доходы Тогда
			Валюта = Параметры.ЗначенияЗаполнения.ЗаказСсылка.ТипПеревозки.БюджетВалютаДохода;
		ИначеЕсли Параметры.ЗначенияЗаполнения.ВидСтатьиПланирования = перечисления.CW_ВидыСтатейПланирования.Расходы Тогда
			Валюта = Параметры.ЗначенияЗаполнения.ЗаказСсылка.ТипПеревозки.БюджетВалютаРасхода;
		КонецЕсли;	
		
		Если Валюта.Пустая() Тогда
			Валюта = CW_Настройки.ВалютаРегламентированногоУчета();
		КонецЕсли;	
	КонецЕсли;
	
	Если Организация.Пустая() Тогда
		Организация = CW_Настройки.ОсновнаяОрганизация();
	КонецЕсли;
	
	Если СтавкаНДС.Пустая() Тогда
		
		ТипДвижения = "ДОХОДЫ";
		Если ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы") Тогда
			ТипДвижения = "РАСХОДЫ";
		КонецЕсли;
	
		ПараметрыСтавкиНДС = Новый Структура;
		ПараметрыСтавкиНДС.Вставить("Дата", 		ТекущаяДата());
		ПараметрыСтавкиНДС.Вставить("Организация", 	Организация);
		ПараметрыСтавкиНДС.Вставить("Номенклатура", Номенклатура);
		ПараметрыСтавкиНДС.Вставить("Договор", 		ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка")); 
		ПараметрыСтавкиНДС.Вставить("ПодставлятьСтавкуНДС",  CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ПодставлятьСтавкуНДС"));
		ПараметрыСтавкиНДС.Вставить("ТипДвижения",  ТипДвижения);
		
		СтавкаНДС = CW_Документы.ПолучитьСтавкуНДС(ПараметрыСтавкиНДС);

	КонецЕсли; 
 
	
	// --- 
	
	ВРУ = CW_Настройки.ВалютаРегламентированногоУчета();
	
	Если Константы.CW_ОграничиватьВыборКонтрагентовПоБюджету.Получить() Тогда
			
		ТаблицаКонтрагентов = ЗаказСсылка.КонтрагентыПоБюджету.Выгрузить();
		
		МассивКонтрагентов = ТаблицаКонтрагентов.ВыгрузитьКолонку("Контрагент");
		
		//ЗАПЛАТКА
		Если Параметры.ЗначенияЗаполнения.Свойство("Контрагент") Тогда
			Если МассивКонтрагентов.Найти(Параметры.ЗначенияЗаполнения.Контрагент) = Неопределено Тогда
				//Добавляем переданного в параметрах контрагента
				МассивКонтрагентов.Добавить(Параметры.ЗначенияЗаполнения.Контрагент);
			КонецЕсли;
		КонецЕсли;
		//ЗАПЛКТКА
		
		Элементы.Контрагент.СписокВыбора.Очистить();
		Для каждого Элемент Из МассивКонтрагентов Цикл
			Элементы.Контрагент.СписокВыбора.Добавить(Элемент);
		КонецЦикла; 
		
		Элементы.Контрагент.РежимВыбораИзСписка = Истина;
		
	КонецЕсли; 
	
	// таб.часть
	_ОбновитьБюджет();
	
	ПоказыватьПриложениеВБюджете = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") 
									И ПолучитьФункциональнуюОпцию("CW_УказыватьДоговорДляПлановыхСтатейБюджета");
	
	Элементы.БюджетПриложениеКДоговору.Видимость = ПоказыватьПриложениеВБюджете;
	
	// --- 
	
	Элементы.БюджетПорядокОтраженияРасходов.Видимость=Ложь;
	Элементы.БюджетПорядокОтраженияДоходов.Видимость=Ложь;
	Если (ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Доходы) Тогда
		Элементы.БюджетПорядокОтраженияДоходов.Видимость=Истина;
	ИначеЕсли (ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы) Тогда 
		Элементы.БюджетПорядокОтраженияРасходов.Видимость=Истина;
	КонецЕсли; 
	
	_ПраваДоступа();
	_УправлениеЭлементамиФормы();
	
	//Использование количества
	ИспользованиеКоличестваДляПлановыхСтатей 			= ПолучитьФункциональнуюОпцию("CW_ИспользованиеКоличестваДляПлановыхСтатей");
	ПолучениеКоличестваУслугИзПараметраГрузоперевозки 	= ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзПараметраГрузоперевозки");
	
	Элементы.ОбновитьКоличество.Видимость = ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки; 
	Если ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки Тогда
		Элементы.ОбновитьКоличество.Доступность = Не ЭтаФорма.ТолькоПросмотр; 
	КонецЕсли;
	//Использование количества 

	// --- 
	
	МассивГП = CW_Мониторинг.ГрузоперевозкиЗаказа(ЗаказСсылка);
	КоличествоГП = МассивГП.Количество();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СохранитьЗначенияКлючевыхПараметров();
	ОбновитьИтоги();
	ОбновитьСтатистику();
	
КонецПроцедуры

&НаСервере
Процедура _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеБюджетов");
	Если НЕ ПравоРедактирования Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.Бюджет.ИзменятьСоставСтрок=Ложь;
		Элементы.Бюджет.ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Элементы.СтавкаНДС.Доступность =  CW_ПраваДоступа.ПравоДоступно("БюджетированиеРедактированиеСтавкиНДС");
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Элементы.БюджетКурс.Видимость = (Валюта <> ВРУ);
	
	Если ЗначениеЗаполнено(Номенклатура)
		И ЗначениеЗаполнено(СтавкаНДС)
		И ЗначениеЗаполнено(Валюта)
		И ЗначениеЗаполнено(Организация)
	Тогда 
	
	// необходимые реквизиты заполнены - откроем для редактирования таб.часть
		Элементы.Бюджет.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
		Элементы.БюджетДобавитьИзЖурнала.Доступность = (НЕ ЭтаФорма.ТолькоПросмотр);
		//Если дфкБюджет.Количество()<>0 Тогда 
		//	// необходимые реквизиты заполнены и по ним найдены данные
		//	// заблокируем изменение реквизитов шапки
		//	//Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
		//КонецЕсли;
		
	Иначе 
		
		// необходимые реквизиты НЕ заполнены - закроем для редактирования таб.часть
		Элементы.Бюджет.ТолькоПросмотр = Истина;
		Элементы.БюджетДобавитьИзЖурнала.Доступность = Ложь;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистику()
	
	Элементы.КоличествоГрузоперевозокПоЗаказу.Заголовок = "Количество грузоперевозок по заказу: "+Формат(дфкБюджет.Количество(),"ЧДЦ=; ЧН=")+"/"+Формат(КоличествоГП,"ЧДЦ=; ЧН=");
	
КонецПроцедуры
  

&НаКлиенте
Процедура ОбновитьБюджет(Команда)
	_ОбновитьБюджет();
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()

	ФорматВывода = "ЧЦ=15; ЧДЦ=2; ЧН=";

	Элементы.БюджетИтого.Заголовок = //Всего: 200,00 USD, без НДС: 200,00 USD.
		"Всего: "		+ Формат(дфкБюджет.Итог("СуммаВсего"),ФорматВывода)	+" "+Строка(Валюта)
		+", Сумма: "	+ Формат(дфкБюджет.Итог("Сумма"),ФорматВывода)		+" "+Строка(Валюта)
		+", НДС: "      + Формат(дфкБюджет.Итог("СуммаНДС"),ФорматВывода)	+" "+Строка(Валюта);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБюджетЕслиЗаполненыОбязательныеРеквизиты()
	
	Если (дфкБюджет.Количество() = 0) Тогда
		
		Если ЗначениеЗаполнено(Номенклатура)
			И ЗначениеЗаполнено(СтавкаНДС)
			И ЗначениеЗаполнено(Валюта)
			И ЗначениеЗаполнено(Организация)
			Тогда 
			
			_ОбновитьБюджет();
			ОбновитьИтоги();
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Номенклатура)
			И ЗначениеЗаполнено(СтавкаНДС)
			И ЗначениеЗаполнено(Валюта)
			И ЗначениеЗаполнено(Организация)
			Тогда 
			
			// изменение - предупреждаем
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаРедактированияСтатей",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Будет произведено редактирование статей. Продолжить?",РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			дфкБюджет.Очистить();
			_УправлениеЭлементамиФормы();
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаРедактированияСтатей(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		// произведем редактирование
		Ответ = _ПроизвестиРедактированиеПриИзменении();
		Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			ВосстановитьЗначенияКлючевыхПараметров();
			
		Иначе
			
			СохранитьЗначенияКлючевыхПараметров();
			
		КонецЕсли; 
		
		_УправлениеЭлементамиФормы();
		
	Иначе
		
		ВосстановитьЗначенияКлючевыхПараметров();
		
	КонецЕсли; 
	
	_ОбновитьБюджет();
	ОбновитьИтоги();
	
КонецПроцедуры

&НаСервере
Функция _ПроизвестиРедактированиеПриИзменении()
	
	Попытка
		
		НачатьТранзакцию();
		
		ВРУ = CW_Настройки.ВалютаРегламентированногоУчета();
		
		Для каждого Стр Из дфкБюджет Цикл
			
			СБ = Стр.СтатьяСсылка.ПолучитьОбъект();

			Если (_Организация <> Организация) Тогда
				СБ.Организация = Организация;
			КонецЕсли; 
			Если (_Контрагент <> Контрагент) Тогда
				СБ.Контрагент = Контрагент;
			КонецЕсли; 
			Если (_Номенклатура <> Номенклатура) Тогда
				СБ.Номенклатура = Номенклатура;
			КонецЕсли;
			
			Если (_Валюта <> Валюта) Тогда
				СБ.Валюта = Валюта;  
				
				КурсКратность = CW_Финансы.ПолучитьКурсВалюты(Валюта, ТекущаяДата());
				
				СБ.Курс 		= КурсКратность.Курс;   
				СБ.Кратность 	= КурсКратность.Кратность;  
				
				_ПересчетСумм(СБ);				
		
			КонецЕсли; 
			Если (_СтавкаНДС <> СтавкаНДС) Тогда
				СБ.СтавкаНДС = СтавкаНДС; 
				
				_ПересчетСумм(СБ);				
				
			КонецЕсли; 

			Если (СБ.Валюта = ВРУ) Тогда
				
				СБ.Курс = 1;   
				СБ.Кратность = 1;  
				
				_ПересчетСумм(СБ);				
				
			КонецЕсли; 

			СБ.Записать();
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Если (ТранзакцияАктивна()) Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    Сообщить(ОписаниеОшибки());    
		
		Возврат(_УФКС.Ответ(1));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ(0));	
	
КонецФункции
 
&НаКлиенте
Функция СохранитьЗначенияКлючевыхПараметров()
	// --- 
	
	_Организация = Организация;
	_Контрагент = Контрагент;
	_Номенклатура = Номенклатура;
	_Валюта = Валюта;
	_СтавкаНДС = СтавкаНДС;
	
	// --- 
КонецФункции

&НаКлиенте
Функция ВосстановитьЗначенияКлючевыхПараметров()
	// --- 
	
	Организация = _Организация;
	Контрагент = _Контрагент;
	Номенклатура = _Номенклатура;
	Валюта = _Валюта;
	СтавкаНДС = _СтавкаНДС;
	
	// --- 
КонецФункции
  
&НаСервере
Процедура _ОбновитьБюджет()
	
	дфкБюджет.Загрузить(CW_Бюджетирование._ПолучитьТаблицуБюджетаДляРедактированияИзЗаказа(ЭтаФорма, Грузоперевозка));
	
	Для Каждого СтрокаБюджета из дфкБюджет Цикл
		СтрокаБюджета.ПредставлениеКурса = ПолучитьПредставлениеКурса(СтрокаБюджета);
	КонецЦикла;

	_УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	_НоменклатураПриИзменении();
	ОбновитьБюджетЕслиЗаполненыОбязательныеРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура _НоменклатураПриИзменении()

	СтавкаНДС 			=  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(Номенклатура);
	ЕдиницаИзмерения 	= Номенклатура.ЕдиницаИзмерения;
	
КонецПроцедуры
 

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ОбновитьБюджетЕслиЗаполненыОбязательныеРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ОбновитьБюджетЕслиЗаполненыОбязательныеРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьБюджетЕслиЗаполненыОбязательныеРеквизиты();
КонецПроцедуры


&НаКлиенте
Процедура БюджетПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Копирование Тогда 
		ЗначениеКопирования = дфкБюджет.НайтиПоИдентификатору(Элемент.ТекущаяСтрока).СтатьяСсылка;
	Иначе 
		ЗначениеКопирования = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Грузоперевозка) Тогда
		МассивГрузоперевозок = Новый Массив;
		МассивГрузоперевозок.Добавить(Грузоперевозка);
		
		ОбработкаВыбораГрузоперевозок(МассивГрузоперевозок, Новый Структура("ЗначениеКопирования",ЗначениеКопирования));
	Иначе
		// найти грузоперевозки по заказу, которых ещё нет в таблице
		// интерактивно отметить к добавлению 
		стру = Новый Структура();
		стру.Вставить("ЗаказСсылка",           ЗаказСсылка);
		стру.Вставить("ВерсияБюджета",         ВерсияБюджета);
		стру.Вставить("ВидСтатьиПланирования", ВидСтатьиПланирования);
		стру.Вставить("Контрагент",            Контрагент);
		стру.Вставить("Номенклатура",          Номенклатура);
		стру.Вставить("Валюта",                Валюта);
		стру.Вставить("СтавкаНДС",             СтавкаНДС);
		стру.Вставить("Организация",           Организация);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", стру);
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораГрузоперевозок",ЭтотОбъект, Новый Структура("ЗначениеКопирования",ЗначениеКопирования)); 
		ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаОтметкиДобавляемыхГрузоперевозок", ПараметрыФормы, Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораГрузоперевозок(МассивГрузоперевозок, ДополнительныеПараметры) Экспорт 
	
	РезультатВыполнения = СоздатьСтатьиБюджетаПоМассивуГрузоперевозокВФоне(МассивГрузоперевозок, ДополнительныеПараметры.ЗначениеКопирования);
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;   
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатДобавленияСтатейБюджета", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры


&НаСервере
Функция СоздатьСтатьиБюджетаПоМассивуГрузоперевозокВФоне(МассивГрузоперевозок, ЗначениеКопирования)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Создание статей бюджета по массиву грузоперевозок";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивГрузоперевозок",	МассивГрузоперевозок); 
	ПараметрыПроцедуры.Вставить("Валюта", 				Валюта); 
	ПараметрыПроцедуры.Вставить("ВидСтатьиПланирования",ВидСтатьиПланирования); 
	ПараметрыПроцедуры.Вставить("ЗначениеКопирования", 	ЗначениеКопирования);  
	ПараметрыПроцедуры.Вставить("ВерсияБюджета", 		ВерсияБюджета);  
	ПараметрыПроцедуры.Вставить("Организация", 			Организация);  
	ПараметрыПроцедуры.Вставить("ВидСтатьиПланирования",ВидСтатьиПланирования);  
	ПараметрыПроцедуры.Вставить("Контрагент", 			Контрагент);  
	ПараметрыПроцедуры.Вставить("Номенклатура", 		Номенклатура);  
	ПараметрыПроцедуры.Вставить("Валюта", 				Валюта);  
	ПараметрыПроцедуры.Вставить("СтавкаНДС", 			СтавкаНДС);  
	ПараметрыПроцедуры.Вставить("ЕдиницаИзмерения", 	ЕдиницаИзмерения);  
	ПараметрыПроцедуры.Вставить("ЦенаСНДС",			 	CW_Настройки.ПолучитьНастройкуПользователя(, "ЦенаСНДС" + ВидСтатьиПланирования));  
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьСтатьиБюджетаПоМассивуГрузоперевозок",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатДобавленияСтатейБюджета(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		_ОбновитьБюджет();
		ОбновитьИтоги();
		ОбновитьСтатистику();
		БылиИзменения = Истина;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось создать статьи бюджета!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка создания статей бюджета");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	Если Поле.ГиперссылкаЯчейки Тогда  
		Если Поле.Имя = "БюджетКурс" Тогда
			Если НЕ _ПравоРедактированияКурса() Тогда
				ПоказатьПредупреждение(, "Недостаточно прав для редактирования курса.",,"Недостаточно прав");
				Возврат;
			КонецЕсли;  
			
			МассивСсылок = ПолучитьМассивВыделенныхСтатей();   
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("МассивСсылок",   	 МассивСсылок);
			ДополнительныеПараметры.Вставить("ВыделенныеСтроки", Элементы.Бюджет.ВыделенныеСтроки);

			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКурса",ЭтотОбъект, ДополнительныеПараметры);  
			
			ПараметрыФормы = ПолучитьСтруктуруПараметровФормыКурса(ВыбраннаяСтрока);
			
			ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаВыбораКурсаВалюты", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли; 
		
		Возврат;
	КонецЕсли;

	Если (Поле.Имя = "БюджетСумма" ИЛИ 
		Поле.Имя = "БюджетСуммаВсего" ИЛИ 
		Поле.Имя = "БюджетПорядокОтраженияРасходов" ИЛИ 
		Поле.Имя = "БюджетПорядокОтраженияДоходов" ИЛИ 
		Поле.Имя = "БюджетКоличество" ИЛИ 
		Поле.Имя = "БюджетЦена" ИЛИ 
		Поле.Имя = "БюджетКомментарий") И 
		НЕ Элементы.Бюджет.ТолькоПросмотр Тогда
		
		МножественноеРедактирование();     
		
	ИначеЕсли  Поле.Имя = "БюджетДоговор" ИЛИ 
		Поле.Имя = "БюджетПриложениеКДоговору"  Тогда
		
		ДанныеСтроки = ПолучитьДанныеСтрок();
		
		МножественноеРедактированиеДоговора(ДанныеСтроки);     
		
	Иначе
		
		БюджетОткрытьСтатью(дфкБюджет.НайтиПоИдентификатору(ВыбраннаяСтрока).СтатьяСсылка, Элементы.Бюджет);
		
	КонецЕсли; 
	
КонецПроцедуры  

&НаКлиенте
функция ПолучитьДанныеСтрок()
	
	мДоговора  = новый Массив;
	мПриложения= новый Массив;
	
	Для каждого ИдентификаторСтроки Из Элементы.Бюджет.ВыделенныеСтроки Цикл  
		Строкатаблицы = дфкБюджет.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если мДоговора.Найти(Строкатаблицы.Договор) = Неопределено Тогда
			мДоговора.Добавить(Строкатаблицы.Договор);	
		КонецЕсли; 
		
		Если мПриложения.Найти(Строкатаблицы.ПриложениеКДоговору) = Неопределено Тогда
			мПриложения.Добавить(Строкатаблицы.ПриложениеКДоговору);	
		КонецЕсли;
	КонецЦикла;   
	
	Структура = новый Структура;
	Структура.Вставить("мДоговора",   мДоговора);
	Структура.Вставить("мПриложения", мПриложения);    
	
	Возврат Структура
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПараметровФормыКурса(ВыбраннаяСтрока) 
	
	СтрокаБюджета = дфкБюджет.НайтиПоИдентификатору(ВыбраннаяСтрока); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецСтатьи", 	СтрокаБюджета.СтатьяСсылка.Владелец);
	ПараметрыФормы.Вставить("ТипКурсаВалюты", 	СтрокаБюджета.СтатьяСсылка.ТипКурсаВалюты);
	ПараметрыФормы.Вставить("Курс", 			СтрокаБюджета.СтатьяСсылка.Курс);
	ПараметрыФормы.Вставить("Кратность", 		СтрокаБюджета.СтатьяСсылка.Кратность);   
	ПараметрыФормы.Вставить("КонтрольнаяДата",  СтрокаБюджета.СтатьяСсылка.КонтрольнаяДатаКурсаДляПроверки); 
	
	ПараметрыФормы.Вставить("ВариантПоДате",  	СтрокаБюджета.СтатьяСсылка.Валюта <> ВРУ); 
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораКурса(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ОбработкаВыбораКурсаНаСервере(Результат, ДополнительныеПараметры);
	
		
	
КонецПроцедуры    

&НаСервере
Процедура ОбработкаВыбораКурсаНаСервере(Результат, ДополнительныеПараметры)
	
	НачатьТранзакцию();
	
	Для Каждого СсылкаВМассиве из ДополнительныеПараметры.МассивСсылок Цикл
		
		СтатьяОбъект = СсылкаВМассиве.ПолучитьОбъект();
		
		СтатьяОбъект.ТипКурсаВалюты 	= Результат.ТипКурсаВалюты;
		
		Если Результат.ТипКурсаВалюты = 0 Тогда   
			
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(СтатьяОбъект.Валюта, СтатьяОбъект.Владелец.ДатаСделкиФ); 
			СтатьяОбъект.Курс 		= СтруктураКурса.Курс;
			СтатьяОбъект.Кратность 	= СтруктураКурса.Кратность; 
			СтатьяОбъект.КонтрольнаяДатаКурсаДляПроверки = Неопределено;	
			
		ИначеЕсли Результат.ТипКурсаВалюты = 1 Тогда
			
			СтатьяОбъект.Курс 		= Результат.Курс;
			СтатьяОбъект.Кратность 	= Результат.Кратность;
			СтатьяОбъект.КонтрольнаяДатаКурсаДляПроверки = Неопределено;	
			
		ИначеЕсли Результат.ТипКурсаВалюты = 2 Тогда 
			
			ДатаКурсаСтатьи 	= CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(СтатьяОбъект.Владелец, Результат.КонтрольнаяДата,  СтатьяОбъект.Владелец.ДатаСделкиФ);
			СтруктураКурса  	= CW_Финансы.ПолучитьКурсВалюты(СтатьяОбъект.Валюта, ДатаКурсаСтатьи.Дата); 
			
			СтатьяОбъект.КонтрольнаяДатаКурсаДляПроверки	= Результат.КонтрольнаяДата;	
			СтатьяОбъект.Курс		= СтруктураКурса.Курс;
			СтатьяОбъект.Кратность	= СтруктураКурса.Кратность; 
			
		КонецЕсли; 
		
		CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(СтатьяОбъект);	
	
		СтатьяОбъект.ОбменДанными.Загрузка = Истина;
		СтатьяОбъект.Записать();
		
	КонецЦикла;   
	
	Попытка
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить курс валюты!");		
	КонецПопытки;

	_ОбновитьБюджет();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеКурса(ПараметрыКурса) 
	
	ПредставлениеКурса = Формат(ПараметрыКурса.Курс, "ЧДЦ=4; ЧГ=0") + ?(ПараметрыКурса.Кратность > 1, "/"+Формат(ПараметрыКурса.Кратность,"ЧЦ=10; ЧГ="), "");
	
	Возврат ПредставлениеКурса; // 
	
КонецФункции  

&НаСервере
Функция _ПравоРедактированияКурса()
	// --- 
	
	Возврат(CW_ПраваДоступа.ПравоДоступно("ИзменениеКурсаПланирования"));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура БюджетПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	БюджетОткрытьСтатью(дфкБюджет.НайтиПоИдентификатору(Элемент.ТекущаяСтрока).СтатьяСсылка, Элементы.Бюджет);
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетОткрытьСтатью(СтатьяСсылка, ЭлементРодитель)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СтатьяСсылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ЭлементРодитель.ТолькоПросмотр);

	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, ЭлементРодитель);

КонецПроцедуры

&НаКлиенте
Процедура БюджетОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	БылиИзменения = Истина;
	ОбновитьБюджет(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура БюджетПередУдалением(Элемент, Отказ)
	
	МассивСтатей = Новый Массив;
	Для каждого Стр Из Элементы.Бюджет.ВыделенныеСтроки Цикл
		
		МассивСтатей.Добавить(дфкБюджет.НайтиПоИдентификатору(Стр).СтатьяСсылка);
		
	КонецЦикла; 
	БюджетУдалитьСтатью(МассивСтатей, Отказ);
	_ОбновитьБюджет();
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура БюджетПослеУдаления(Элемент)
	_ОбновитьБюджет();
	ОбновитьИтоги();
	ОбновитьСтатистику();
	БылиИзменения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура БюджетУдалитьСтатью(МассивСтатей, Отказ)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияСтатьи",ЭтотОбъект, Новый Структура("МассивСтатей",МассивСтатей)); 
	ПоказатьВопрос(ПОВ,
			"Удалить статьи?
			|Отменить удаление будет невозможно."
			, РежимДиалогаВопрос.ОКОтмена
		);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУдаленияСтатьи(Ответ, ДополнительныеПараметры) Экспорт 

	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		_БюджетУдалитьСтатьи(ДополнительныеПараметры.МассивСтатей);
		ОбновитьСтатистику();
	КонецЕсли; 
	
КонецПроцедуры
  
&НаСервере
Процедура _БюджетУдалитьСтатьи(МассивСтатей)
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого СтатьяСсылка Из МассивСтатей Цикл
		// удалим из базы
		об = СтатьяСсылка.ПолучитьОбъект();
		об.Удалить();
		// удалим из экранной формы
		массивСтрокСтатьи = дфкБюджет.НайтиСтроки(Новый Структура("СтатьяСсылка",СтатьяСсылка));
		Для каждого строкаБюджета Из массивСтрокСтатьи Цикл
			дфкБюджет.Удалить(дфкБюджет.Индекс(строкаБюджета));
		КонецЦикла; 
	КонецЦикла; 
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивВыделенныхСтатей()
	
	масс = Новый Массив;
	Для каждого Стр Из Элементы.Бюджет.ВыделенныеСтроки Цикл
		масс.Добавить(дфкБюджет.НайтиПоИдентификатору(Стр).СтатьяСсылка);
	КонецЦикла;
	Возврат масс;
	
КонецФункции

&НаКлиенте
Процедура МножественноеРедактирование()
		
	ПараметрыФормы = Новый Структура();
	
	Если (Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетКурс") Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",         "Курс");
		ПараметрыФормы.Вставить("Заголовок",            "Курс");
		ПараметрыФормы.Вставить("НадписьСверху",        "Введите значение курса валюты "+Валюта+":");
		
	ИначеЕсли Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетПорядокОтраженияРасходов" Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",         "ПорядокОтраженияРасходов");
		ПараметрыФормы.Вставить("Заголовок",            "Порядок отражения расходов");
		ПараметрыФормы.Вставить("НадписьСверху",        "Порядок отражения");
		
	ИначеЕсли Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетПорядокОтраженияДоходов" Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",         "ПорядокОтраженияДоходов");
		ПараметрыФормы.Вставить("Заголовок",            "Порядок отражения доходов");
		ПараметрыФормы.Вставить("НадписьСверху",        "Порядок отражения");
		
	ИначеЕсли Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетСумма" Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",                  "Сумма");
		ПараметрыФормы.Вставить("Заголовок",                     "Сумма");
		ПараметрыФормы.Вставить("НадписьСверху",                 "Сумма, "+Валюта+":");
		ПараметрыФормы.Вставить("ВыбиратьВариантОтнесенияСуммы", Истина);
		ПараметрыФормы.Вставить("ВыбиратьУчитыватьНДСВСебестоимости", Истина);

	ИначеЕсли Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетКоличество" Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",                  "Количество");
		ПараметрыФормы.Вставить("Заголовок",                     "Количество");
		ПараметрыФормы.Вставить("НадписьСверху",                 "Количество:");
		ПараметрыФормы.Вставить("ВыбиратьВариантОтнесенияСуммы", Истина);
		ПараметрыФормы.Вставить("ЗаголовокГруппыРаспределениеСуммы", "Распределение количества");
		
	ИначеЕсли Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетЦена" Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",                  "Цена");
		ПараметрыФормы.Вставить("Заголовок",                     "Цена");
		ПараметрыФормы.Вставить("НадписьСверху",                 "Цена:");
		ПараметрыФормы.Вставить("ВыбиратьВариантОтнесенияСуммы", Ложь);
		ПараметрыФормы.Вставить("ВыбиратьЦенаСНДС", 			 Истина);

	ИначеЕсли Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетСуммаВсего" Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",                  "СуммаВсего");
		ПараметрыФормы.Вставить("Заголовок",                     "Сумма всего");
		ПараметрыФормы.Вставить("НадписьСверху",                 "Сумма всего, "+Валюта+":");
		ПараметрыФормы.Вставить("ВыбиратьВариантОтнесенияСуммы", Истина);
		
	ИначеЕсли Элементы.Бюджет.ТекущийЭлемент.Имя = "БюджетКомментарий" Тогда 
		ПараметрыФормы.Вставить("ИмяРеквизита",  "Комментарий");
		ПараметрыФормы.Вставить("Заголовок",     "Комментарий");
		ПараметрыФормы.Вставить("НадписьСверху", "Комментарий");
		
	Иначе 
		Возврат;
		
	КонецЕсли;
		
	МассивСсылок = ПолучитьМассивВыделенныхСтатей();
	ПараметрыФормы.Вставить("МассивСсылок",   МассивСсылок);
	ПараметрыФормы.Вставить("ИмяСправочника", "CW_ПлановыеСтатьиЗатратИДоходов");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияЗначения",ЭтотОбъект, Новый Структура("ПараметрыФормы,МассивСсылок", ПараметрыФормы, МассивСсылок)); 
	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_РедактированияРеквизита", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура МножественноеРедактированиеДоговора(ДанныеСтроки)
	
	МассивСсылок = ПолучитьМассивВыделенныхСтатей();

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивСсылок", МассивСсылок);    
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Контрагент); 
	
	Если ДанныеСтроки.мДоговора.Количество() = 1 Тогда
		ПараметрыФормы.Вставить("Договор", ДанныеСтроки.мДоговора[0]); 
	КонецЕсли;
	Если ДанныеСтроки.мПриложения.Количество() = 1 Тогда
		ПараметрыФормы.Вставить("ПриложениеКДоговору", ДанныеСтроки.мПриложения[0]); 
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияДоговораПриложения",ЭтотОбъект, ДополнительныеПараметры); 
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаГрупповогоРедактированияДоговораИПриложения", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаИзмененияДоговораПриложения(РезультатВыбора, ДополнительныеПараметры) Экспорт        
	
	Если РезультатВыбора = Неопределено 
		или РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаИзмененияДоговораПриложенияНаСервере(РезультатВыбора, ДополнительныеПараметры);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаИзмененияДоговораПриложенияНаСервере(РезультатВыбора, ДополнительныеПараметры) 
	
	НачатьТранзакцию();
	
	Для Каждого ЗначениеСсылки из ДополнительныеПараметры.МассивСсылок Цикл
		
		ЕстьИзменения = Ложь;
		СтатьяОбъект = ЗначениеСсылки.ПолучитьОбъект();   
		
		Если СтатьяОбъект.Договор <> РезультатВыбора.Договор Тогда
			СтатьяОбъект.Договор = РезультатВыбора.Договор;    
			
			Если ЗначениеЗаполнено(СтатьяОбъект.Договор) Тогда
				СтатьяОбъект.Валюта 		= СтатьяОбъект.Договор.ВалютаДоговора;
				СтатьяОбъект.Организация 	= СтатьяОбъект.Договор.Организация;  
			КонецЕсли;
			
			ЕстьИзменения = Истина;
		КонецЕсли;              
		
		Если СтатьяОбъект.ПриложениеКДоговору <> РезультатВыбора.ПриложениеКДоговору Тогда
			СтатьяОбъект.ПриложениеКДоговору = РезультатВыбора.ПриложениеКДоговору;  
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			СтатьяОбъект.Записать();    
		КонецЕсли;           
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	_ОбновитьБюджет();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияЗначения(ОтветРедактированияРеквизита, ДополнительныеПараметры) Экспорт 
	
	Если (ОтветРедактированияРеквизита <> Неопределено) Тогда 
		_УстановкаЗначенияНаВыделенныеСтроки(ОтветРедактированияРеквизита, ДополнительныеПараметры);
		ОбновитьИтоги();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура _УстановкаЗначенияНаВыделенныеСтроки(ОтветРедактированияРеквизита, ДополнительныеПараметры)
	
	ОстатокНДС = 0;  
	ЦенаСНДС = Ложь; 
	УчитыватьНДСВСебестоимости = Ложь;
	
	МассивСсылок = ДополнительныеПараметры.МассивСсылок;
	ИмяРеквизита = ДополнительныеПараметры.ПараметрыФормы.ИмяРеквизита;
	Если ТипЗнч(ОтветРедактированияРеквизита.Значение) = Тип("Число") И МассивСсылок.Количество()>1 Тогда 
		Делитель               = ?(ЗначениеЗаполнено(ОтветРедактированияРеквизита.Делитель), ОтветРедактированияРеквизита.Делитель, 1);
		НовоеЗначениеРеквизита = Окр(ОтветРедактированияРеквизита.Значение/Делитель, МассивСсылок[0].Метаданные().Реквизиты[ИмяРеквизита].Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти);
		НовоеЗначениеПоследнее = ОтветРедактированияРеквизита.Значение - НовоеЗначениеРеквизита * (Делитель - 1); // если делим, то на относим ошибки округления на последний элемент
	Иначе
		Делитель = Неопределено;
		НовоеЗначениеРеквизита = ОтветРедактированияРеквизита.Значение;
		НовоеЗначениеПоследнее = НовоеЗначениеРеквизита; 
		
		Если ИмяРеквизита =  "Цена" Тогда
			ЦенаСНДС = ОтветРедактированияРеквизита.ЦенаСНДС;			
		ИначеЕсли ИмяРеквизита =  "Сумма" Тогда
			УчитыватьНДСВСебестоимости = ОтветРедактированияРеквизита.УчитыватьНДСВСебестоимости;			
		КонецЕсли; 
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для индекс = 0 По МассивСсылок.ВГраница() Цикл  
		
		СтатьяСсылка = МассивСсылок[индекс];
		об = СтатьяСсылка.ПолучитьОбъект();
		
		// проверим были ли внесены изменения
		БылиИзменения = об[ИмяРеквизита] <> НовоеЗначениеРеквизита;
		Если ИмяРеквизита = "Цена" Тогда
			Если ЦенаСНДС <> об.ЦенаСНДС Тогда
				БылиИзменения = Истина;
			КонецЕсли;
		ИначеЕсли ИмяРеквизита = "Сумма" Тогда 
			Если УчитыватьНДСВСебестоимости <> об.УчитыватьНДСВСебестоимости Тогда
				БылиИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если БылиИзменения Тогда 
			Если индекс = МассивСсылок.ВГраница() Тогда 
				об[ИмяРеквизита] = НовоеЗначениеПоследнее; // для чисел боремся с ошибкой округления
			Иначе 
				об[ИмяРеквизита] = НовоеЗначениеРеквизита;
			КонецЕсли;    
			
			Если ИмяРеквизита = "Цена" Тогда
				Об.ЦенаСНДС = ЦенаСНДС;	
			ИначеЕсли ИмяРеквизита = "Сумма" Тогда
				Об.УчитыватьНДСВСебестоимости = УчитыватьНДСВСебестоимости;	
			КонецЕсли;
			
			Выполнить("_" + ИмяРеквизита + "ПриИзменении(об)");
			об.Записать();
			
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтветРедактированияРеквизита.ВариантРаспределенияНДС = 1 Тогда
		
		//Получим общую сумму по всем ссылкам
		ИтогоСуммаВсего = 0;
		Для Каждого СсылкаМассива из МассивСсылок Цикл
			ИтогоСуммаВсего = ИтогоСуммаВсего	+ СсылкаМассива.СуммаВсего;  
		КонецЦикла;
		
		СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(СтавкаНДС);
		ИтогоНДС 			= Окр(ИтогоСуммаВсего * СтавкаНДСПроцент/(100+СтавкаНДСПроцент),2);
		
		Для Каждого СсылкаМассива из МассивСсылок Цикл
			ИтогоНДС = ИтогоНДС - СсылкаМассива.СуммаНДС;
		КонецЦикла;
		
		Если ИтогоНДС <> 0 Тогда
			ОбъектСсылки = СсылкаМассива.ПолучитьОбъект();
			
			ОбъектСсылки.СуммаНДС 	= ОбъектСсылки.СуммаНДС + ИтогоНДС; 
			_СуммаНДСПриИзменении(ОбъектСсылки);

			ОбъектСсылки.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	_ОбновитьБюджет();

КонецПроцедуры

&НаСервере
Процедура _КоличествоПриИзменении(Объект) 

	Если Объект.Количество = 0 Тогда
		Объект.Количество = 1;	
	КонецЕсли;
	
	_ЦенаПриИзменении(Объект);
	
КонецПроцедуры 

&НаСервере
Процедура _ЦенаПриИзменении(Объект)   
	
	CW_Бюджетирование.ПриИзмененииЦеныСтатьиБюджета(Объект);
	
КонецПроцедуры

&НаСервере
Процедура _СуммаПриИзменении(Объект)
	
	CW_Бюджетирование.ПриИзмененииСуммыСтатьиБюджета(Объект);
	
КонецПроцедуры

&НаСервере
Процедура _СуммаНДСПриИзменении(Объект)  
	
	CW_Бюджетирование.ПриИзмененииСуммыНДССтатьиБюджета(Объект);
	
КонецПроцедуры   

&НаСервере
Процедура _СуммаВсегоПриИзменении(Объект)
	
	CW_Бюджетирование.ПриИзмененииСуммыВсегоСтатьиБюджета(Объект);
	
КонецПроцедуры

&НаСервере
Процедура _КурсПриИзменении(Объект)
	_ПересчетСумм(Объект);
КонецПроцедуры

&НаСервере
Процедура _КонтрольнаяДатаКурсаДляПроверкиПриИзменении(Объект)
	
	CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(Объект);	
	
КонецПроцедуры

&НаСервере
Процедура _ПересчетСумм(Объект)
	ОбратныйПересчетВДокументах  = CW_Настройки.ПолучитьНастройкуПользователя(,"ОбратныйПересчетВДокументах");
	Если ОбратныйПересчетВДокументах Тогда
		_СуммаВсегоПриИзменении(Объект);
	Иначе 
		_СуммаПриИзменении(Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура _ПорядокОтраженияДоходовПриИзменении(Объект)

КонецПроцедуры

&НаСервере
Процедура _ПорядокОтраженияРасходовПриИзменении(Объект)

КонецПроцедуры

&НаСервере
Процедура _КомментарийПриИзменении(Объект)

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьБюджетЕслиЗаполненыОбязательныеРеквизиты();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	_УФК.ВыбратьНоменклатуру(Номенклатура,Элемент,ДанныеВыбора,СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция _КаталогНоменклатуры()
	// --- 
	
	Возврат(Константы.CW_КаталогУслуг.Получить());
	
	// --- 
КонецФункции

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если (НЕ Элемент.РежимВыбораИзСписка) Тогда
		
		Если (ВидСтатьиПланирования=ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы")) Тогда
			_УФК.ВыбратьКлиента(Контрагент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
		ИначеЕсли (ВидСтатьиПланирования=ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы")) Тогда 
			_УФК.ВыбратьПоставщика(Контрагент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если (дфкБюджет.Количество() <> 0) Тогда
		ОповеститьОЗаписиНового(дфкБюджет[0].СтатьяСсылка);
	Иначе
		ОповеститьОЗаписиНового(ПредопределенноеЗначение("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ПустаяСсылка"));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзЖурнала(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодбораИзЖурнала",ЭтотОбъект); 
	ПФ = Новый Структура("РежимВыбора,РежимОткрытия,Заказ",Истина,"ДляБюджета",ЗаказСсылка);
	ОткрытьФорму("Обработка.CW_ЖурналГрузоперевозок.Форма.Форма",ПФ, ЭтаФорма,Истина,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораИзЖурнала(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		МассивДублей = Новый Массив;
		МассивДобавляемых = Новый Массив;
		Для каждого Стр Из Ответ Цикл
			
			// проверяем, что такой г/п нет в списке
			Отбор = Новый Структура("Грузоперевозка",Стр);
			мстр = дфкБюджет.НайтиСтроки(Отбор);
			Если (мстр.Количество()=0) Тогда
				
				МассивДобавляемых.Добавить(Стр);
				
			Иначе
				
				МассивДублей.Добавить(Стр);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если (МассивДобавляемых.Количество() <> 0) Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ЗначениеКопирования", Неопределено);
			ОбработкаВыбораГрузоперевозок(МассивДобавляемых, ДополнительныеПараметры);
			
			ОбновитьИтоги();
			БылиИзменения = Истина;
			
		КонецЕсли; 
		
		Если (МассивДублей.Количество() <> 0) Тогда
			
			ПредставлениеГП = "";
			Для каждого Стр Из МассивДублей Цикл
				Если (ПредставлениеГП <> "") Тогда
					ПредставлениеГП = ПредставлениеГП + ", ";
				КонецЕсли; 
				ПредставлениеГП = ПредставлениеГП + Строка(Стр);
			КонецЦикла; 
			_УФК.ВывестиПредупреждение("Грузоперевозка """+Строка(ПредставлениеГП)+""" уже добавлена.");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

//Использование количества
&НаКлиенте
Процедура ОбновитьКоличество(Команда)  
	
	РезультатВыполнения =  ОбновитьКоличествоНаСервереВФоне(ВидСтатьиПланирования);
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидСтатьиПланирования", ВидСтатьиПланирования);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОбновленияКоличества", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры   

&НаСервере
Функция ОбновитьКоличествоНаСервереВФоне(ВидСтатьиПланирования)
	
	МассивСтатей = ПолучитьМассивСтатейБюджетаНаСервере(); 
	Если МассивСтатей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Обновление количества статей бюджета: "+Строка(ЗаказСсылка);
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивСтатей", 	МассивСтатей);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ПлановыеСтатьиЗатратИДоходов.ОбновитьКоличествоПлановыхСтатей",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции    

&НаСервере
Функция ПолучитьМассивСтатейБюджетаНаСервере()
	
	МассивСтатей = Новый Массив;
	Для Каждого СтрокаБюджета из дфкБюджет Цикл
		БюджетЗаблокирован = РегистрыСведений.CW_УтверждениеБюджетов.ПолучитьБлокировкуБюджета(СтрокаБюджета.Грузоперевозка, ВерсияБюджета);
		Если БюджетЗаблокирован Тогда
			Продолжить;
		КонецЕсли;                     
		МассивСтатей.Добавить(СтрокаБюджета.СтатьяСсылка);	
	КонецЦикла;
	
	Возврат МассивСтатей;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатОбновленияКоличества(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Грузоперевозка = ПредопределенноеЗначение("Справочник.CW_Грузоперевозки.ПустаяСсылка");	
		_ОбновитьБюджет();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось обновить количество одной или нескольких статей бюджета!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка обновления количества");
	КонецЕсли;
	
КонецПроцедуры
//Использование количества

&НаКлиенте
Процедура ПрогнозОплаты(Команда)
	
	ВыделенныеСтроки = Элементы.Бюджет.ВыделенныеСтроки;
	ПараметрыСтатьи  = ПолучитьПараметрыСтатьиБюджета(ВыделенныеСтроки);
	Если ПараметрыСтатьи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", ПараметрыСтатьи.Владелец);        
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПрогнозПредставлениеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаПрогнозаОплаты", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьПараметрыСтатьиБюджета(ВыделенныеСтроки)
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаБюджета = дфкБюджет.НайтиПоИдентификатору(ВыделенныеСтроки[0]);   
	СтатьяБюджета = СтрокаБюджета.СтатьяСсылка;
	
	ПараметрыСтатьи = Новый Структура;
	ПараметрыСтатьи.Вставить("Владелец", СтатьяБюджета.Владелец); 
	
	Возврат ПараметрыСтатьи;
	
КонецФункции

&НаКлиенте
Процедура ПрогнозПредставлениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ПрогнозПредставлениеЗавершениеНаСервере(Результат, ДополнительныеПараметры);	
	
КонецПроцедуры

&НаСервере
Процедура ПрогнозПредставлениеЗавершениеНаСервере(Результат, ДополнительныеПараметры)
	
	Для Каждого ИдентификаторСтроки из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		
		СтрокаБюджета = дфкБюджет.НайтиПоИдентификатору(ИдентификаторСтроки);  
		
		СтатьяБюджетаОбъект = СтрокаБюджета.СтатьяСсылка.ПолучитьОбъект();
		СтатьяБюджетаОбъект.ВариантПрогноза = Результат.ВариантПрогноза;
		СтатьяБюджетаОбъект.ПрогнозКонтрольнаяДата = Результат.ПрогнозКонтрольнаяДата;
		СтатьяБюджетаОбъект.ПрогнозКоличествоДней = Результат.ПрогнозКоличествоДней;
		СтатьяБюджетаОбъект.ПрогнозКоличествоДнейПлан = Результат.ПрогнозКоличествоДнейПлан;
		СтатьяБюджетаОбъект.Записать();
		
		РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ЗаписатьПрогнозОплаты(СтрокаБюджета.СтатьяСсылка, Результат.ПрогнозДата);
		
		СтрокаБюджета.ПлановаяДатаОплаты = Результат.ПрогнозДата;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьПрогноз(Команда)

	ВыделенныеСтроки = Элементы.Бюджет.ВыделенныеСтроки;
 	ПараметрыСтатьи  = ПолучитьПараметрыСтатьиБюджета(ВыделенныеСтроки);
	Если ПараметрыСтатьи = Неопределено 
		или ТипЗнч(ПараметрыСтатьи.Владелец) <> Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат;
	КонецЕсли;   

	РасчитатьПрогнозНаСервере(ВыделенныеСтроки);

КонецПроцедуры  

&НаСервере
Процедура РасчитатьПрогнозНаСервере(ВыделенныеСтроки)

	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл     
		
		СтрокаБюджета = дфкБюджет.НайтиПоИдентификатору(ИдентификаторСтроки);  
		СтатьяБюджета = СтрокаБюджета.СтатьяСсылка;   
		ПрогнозДата   = РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ПолучитьПрогнозОплаты(СтатьяБюджета);
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("ВариантПрогноза", 			СтатьяБюджета.ВариантПрогноза);
		ПараметрыРасчета.Вставить("Владелец", 					СтатьяБюджета.Владелец);
		ПараметрыРасчета.Вставить("ПрогнозКонтрольнаяДата", 	СтатьяБюджета.ПрогнозКонтрольнаяДата);
		ПараметрыРасчета.Вставить("ПрогнозКоличествоДней", 		СтатьяБюджета.ПрогнозКоличествоДней);
		ПараметрыРасчета.Вставить("ПрогнозКоличествоДнейПлан", 	СтатьяБюджета.ПрогнозКоличествоДнейПлан);
		
		ПараметрыРасчета.Вставить("ПрогнозДата",	 			ПрогнозДата);
		ПараметрыРасчета.Вставить("ДатаНачалаПеревозки", 		СтатьяБюджета.Владелец.ДатаСделкиФ);
		
		НовыйПрогнозДата = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.РассчитатьПрогнозОплатыСтатьиБюджета(ПараметрыРасчета); 
		Если НовыйПрогнозДата <> Неопределено 
			И НовыйПрогнозДата <> ПрогнозДата Тогда
			РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ЗаписатьПрогнозОплаты(СтатьяБюджета, НовыйПрогнозДата);
			
			СтрокаБюджета.ПлановаяДатаОплаты = НовыйПрогнозДата;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
